Repository: shorstok/trk
Catalog: trackvisualizer/Properties/Resources.*.resx
Languages: uk

# AsterTileLocal_DownloadAndUnpack_ConnectingToAsterServer
source: Connecting to ASTER ({0})...
uk: З´єднання з сервером ASTER ({0})...

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_SrtmInterpNotFound
source: Missing height-correction utility `{0}`
uk: Не знайдена програма корекції висоти `{0}`

# AsterTileLocal_DownloadAndUnpack_UsingExistingGeotiffFormatted
source: Found file{0}, using as preloaded GEOTIFF
uk: Знайдений файл {0}, використовую як вже завантажений GEOTIFF

# AsterTileLocal_DownloadAndUnpack_LoadingTileFormatted
source: Loading tile {0} Kb / {1} kB
uk: Завантаження тайлу {0} кБ / {1} кБ

# AsterTileLocal_DownloadAndUnpack_UnpackingFormatted
source: Unpacking...
uk: Розпаковка...

# AsterTileLocal_DownloadAndUnpack_Ready
source: Ready
uk: Готово

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_DownloadingFormatted
source: Loading {0}...
uk: Завантаження {0}...

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_LoadProgressFormatted
source: Loading {0:0.0} Kb...
uk: Завантаження {0:0.0} КБ...

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_Error404Reasons
source: Remote server responded with 404 (not found). Cause could be:
uk: Віддалений сервер повернув 404 (не знайдений). Причини можуть бути наступні:

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_E404NoSrtmOnServer
source: 🔘 Server doesn't have SRTMs for this region
uk: 🔘 SRTM-файлів для цього району немає на сервері

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_E404ServerAddrObsolete
source: 🔘 Server address obsolete, you have to look for fresh one
uk: 🔘 Адрес застарів і необхідно шукати наступний

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_E404ServerAddrInvalid
source: 🔘 Invalid server address in loader window
uk: 🔘 Невірно прописана адреса серверу в вікні завантажувача

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_UnpackingFormatted
source: Unpacking {0}
uk: Розпаковка {0}

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_ErrorNoHgtFileInArchive
source: {0} - .hgt file missing in archive, something is wrong
uk: {0} - файл .hgt не знайдений в архіві, щось пішло не так

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_CleanupActionFormatted
source: {0}.hgt, cleaning up voids...
uk: {0}.hgt, чистка лакун...

source: Error unpacking: `{0}`! File {1} loaded, but you have to unpack it manually
uk: Помилка при розпакуванні: `{0}`! Файл {1} завантажений, але вам необхідно розпакувати його вручну

# SrtmFileDownloadHeightmapProvider_ExecuteCommandAsync_ErrorGeneral
source: Errror:
uk: Помилка:

# SrtmFileDownloadHeightmapProvider_DownloadHeightmap_HeightmapReadyFormatted
source: {0} ready.
uk: {0} готовий.

# HtmlReportExporter_Export_SectionNameHeader
source: Section
uk: Ділянка

# HtmlReportExporter_Export_SectionDistanceHeader
source: Distance, km
uk: Відстань, км

# HtmlReportExporter_Export_TravelTimeHeader
source: Travel time, h
uk: Ходовий час, год

# HtmlReportExporter_Export_AscentHeader
source: Elevation gain, m
uk: Набір висоти, м

# HtmlReportExporter_Export_DescentHeader
source: Elevation loss, m
uk: Скидання висоти, м

# HtmlReportExporter_Export_MaxHeightHeader
source: Maximum height, m
uk: Максимальна висота, м

# HtmlReportExporter_Export_TotalsRowLabel
source: Travel totals
uk: Всього за похід

# HtmlReportExporter_BuildHtml_ReportTitleTemplateFormatted
source: Report based on track {0}
uk: Звіт на базі треку {0}

# HeightmapDownloaderVm_StartDownloadAsync_SelectSource
source: Select download source
uk: Виберіть джерело для завантаження

# HeightmapDownloaderVm_Initialize_ErrorNoSourcesFound
source: Missing sources for heightmaps download
uk: Відсутні джерела для завантаження карт висоти

# TrackChartVm_YFormatter_ChartSubscriptHeightFormatted
source: {0:0.} m
uk: {0:0.} м

# TrackChartVm_XFormatter_ChartSubscriptLengthFormatted
source: {0:0.} Km
uk: {0:0.} км

# TrackChartVm_TrackChartVm_HeightSeriesTitle
source: Height
uk: Висота

# TrackChartVm_TrackChartVm_SectionSeriesTitle
source: Section
uk: Ділянка

# TrackChartVm_GetSectionLabel_FinishFormatted
source: Finish {0:0.} Km
uk: Фініш {0:0.} км

# TrackReportItemVm_Comment_LeavingDrop
source: leaving supply stash
uk: залишаємо закидку

# TrackReportItemVm_Comment_DropBeforeStart
source: supply stash is placed before route start
uk: завозимо закидку на початок маршруту

# TrackReportItemVm_Comment_PickingDrop
source: picking supply stash
uk: забираємо закидку

# TrackReportVm_CreateReportAsync_ErrNoHeightmap
source: Calculation stopped due to missing heightmaps
uk: Розрахунок завершений в зв'язку з відсутністю карт висоти

# TrackReportVm_CreateReportAsync_ErrNoTrack
source: Track not loaded
uk: Не завантажений трек

# TrackReportVm_CreateReportAsync_ErrNoPointsInTrack
source: Not enough points in track
uk: Недостатньо точок на треці

# TrackReportVm_CreateReportAsync_ErrNotEnoughPoints
source: Not enough waypoints to split track
uk: Недостатньо точок розбивки на дні

# TrackReportVm_CreateReportAsync_SplittingTrack
source: Splitting track to day sections
uk: Розбивка трека на дні

# TrackReportVm_CreateReportAsync_ErrSplitEmptyCantContinue
source: Empy track split! Couldnt split track to day sections
uk: Розбивка пуста! Неможливо розбити трек на дні

# TrackReportVm_CreateReportAsync_RefiningSplit
source: Refining track split
uk: Уточнення розбивки

# TrackReportVm_CreateReportAsync_DeltaCalculation
source: Calculating elevation delta
uk: Разрахунок перепадів висоти

# TrackReportVm_CreateReportAsync_ErrHeightmapInvalid
source: Heightmap <{0}> has invalid values. Run srtm_interp {1} using command line. Otherwise, you'll get completely invalid height calculations!
uk: В файлі висоти <{0}> знайдені невірні значення. Запусть з командного рядку srtm_interp {1} в іншому випадку всі розрахунки, які залежать від висоти будуть абсолютно бредовими!

# TrackVm_LoadTracksFromFile_GeneralErrDuringFileLoad
source: Error while loading file!
uk: Помилка при завантаженні файлу!

# TrackVm_LoadTracksFromFile_TrackNotFound
source: No track in file!
uk: Немає трека в файлі!

# TrackVm_LoadTracksFromFile_MergingTracksFormatted
source: Glueing {0} tracks
uk: Зклеюю {0} треки

# TrackVm_LoadTracksFromFile_SingleTrackLoaded
source: One track loaded
uk: Завантажен 1 трек

# TrackVm_LoadTracksFromFile_LoadingHeightmap
source: Loading heightmaps (SRTM)
uk: Завантаження даних висоти (SRTM)

# TrackVm_LoadTracksFromFile_HeightmapsRequired
source: Track requires heightmaps
uk: Для треку необхідні файли

# TrackVm_LoadTracksFromFile_LoadingHeightmaps
source: Loading files...
uk: Завантаження файлів...

# TrackVm_LoadTracksFromFile_ErrHeightmapsMissing
source: Following SRTMs are found missing during load:
uk: На етапі завантаження SRTM не знайдені наступні карти висот:

# TrackVm_LoadTracksFromFile_ErrHeightmapDownloadRequired
source: They have to be loaded from NASA server or similiar source
uk: Їх необхідно завантажити з серверу NASA або іншого джерела

# TrackVm_LoadTracksFromFile_AllHeightmapsLoadedOk
source: All SRTM files loaded OK!
uk: Всі SRTM файли завантажені вдало!

# TrackVm_LoadTracksFromFile_TrackLoadedOk
source: Track loaded successfully
uk: Завантаження треку завершено вдло

# TrackVm_ValidateSlicepoints_NotEnoughSlicepoints
source: Selected track doesnt have enough waypoints to split by day sections! You have to specify waypoint source additionally, or resave selected track file with waypoints included.
uk: В вибраному файлі недостатньо точок розбивки по дням! Тепер точки можна завантажити окремо, або зберегти заново вибраний .gpx файл вже з точками.

# TrackVm_ValidateSlicepoints_FoundNSlicepointsFormatted
source: Loaded {0} waypoints
uk: Завантаження {0} точок

# MainWindow_HeightmapHeader
source: Elevation profile
uk: Висотний графік

# MainWindow_LoadButtonTitle
source: Open track file
uk: Відкрити файл з треком

# MainWindow_LoadingLabel
source: Loading...
uk: Завантаження...

# MainWindow_LoadTrackLabel
source: Load track
uk: Завантажити трек

# MainWindow_RouteHeader
source: Route
uk: Маршрут

# MainWindow_Route_ExportLabel
source: Export
uk: Експорт

# MainWindow_Route_HeightmapsMissingLabel
source: Heightmaps missing
uk: Відсутні карти висот

# MainWindow_LoadHeightmaps_Label
source: Download heightmaps
uk: Завантажити карти висот

# MainWindow_Title
source: Travel planning
uk: Плаунвання подорожі

# MainWindow_Route_AscentHeader
source: Gain per day, m
uk: Набір за день, м

# MainWindow_Route_BackpackWeightFHeader
source: Backpack weight F, kg
uk: Вага рюкзака, Ж

# MainWindow_Route_BackpackWeightMHeader
source: Backpack weight M, kg
uk: Вага рюкзака, М

# MainWindow_Route_DeltaHeightHeader
source: Elevation delta sum, m
uk: Перепад за день, м

# MainWindow_Route_DescentHeader
source: Elevation loss, m
uk: Зкидання за день, м

# MainWindow_Route_DistanceHeader
source: Distance, km
uk: Відстань, км

# MainWindow_Route_FietsHeader
source: FIETS Index
uk: Індекс FIETS

# MainWindow_Route_FinHeightHeader
source: Sleep height, m
uk: Висота ночівлі, м

# MainWindow_Route_MaxHeightHeader
source: Maximum height, m
uk: Максимальна висота, м

# MainWindow_Route_NotableHeightsHeader
source: Main heights, m
uk: Основні висоти на ділянці, м

# MainWindow_Route_SectionHeader
source: Section
uk: Ділянка

# MainWindow_Route_TimeHeader
source: Travel time, h
uk: Ходовий час, год

# TrackReportVm_ExportReportAsync_Select_report_format
source: Select report format
uk: Оберіть формат експорту

# SettingsWindow_Title
source: Program settings
uk: Налаштування програми

# SettingsWindow_Cancel
source: Cancel
uk: Скасувати

# SettingsWindow_Save
source: Save
uk: Зберегти

# SettingsWindow_Language
source: Language
uk: Мова

# HeightmapDownloaderWindow_Cancel
source: Cancel
uk: Скасувати

# HeightmapDownloaderWindow_HeightmapProvider
source: Heightmap provider
uk: Провайдер карти висот

# HeightmapDownloaderWindow_Load
source: Load
uk: Завантажити

# HeightmapDownloaderWindow_SrtmTemplate
source: SRTM source URL template
uk: Шаблон адреси для завантаження файлів SRTM

# HeightmapDownloaderWindow_WindowTitle
source: Heightmap download
uk: Завантаження карти висот
